---
type: WorksetId
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# WorksetId

`Autodesk.Revit.DB.WorksetId` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WorksetId | — | `public WorksetId ( int id )` |
| Method | Compare | — | `public int Compare ( WorksetId id )` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | ToString | — | `public override string ToString ()` |
| Property | IntegerValue | — | `public int IntegerValue { get ; }` |
| Property | InvalidWorksetId | — | `public static WorksetId InvalidWorksetId { get ; }` |